# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 8 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [1, 1, 512] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

backbone:
  # [from, repeats, module, args]
  - [-1, 1, AA_SPDConv, [32]]  # 0-P1/2

  - [-1, 1, AA_SPDConv, [64]]  # 1-P2/4
  - [-1, 2, MultiBranchUIB, [64, 0.5, [[3, 3, 4], [3, 3, 4]]]]  # 2

  - [-1, 1, AA_SPDConv, [128]]  # 3-P3/8
  - [-1, 4, MultiBranchUIB, [128, 0.5, [[3, 3, 4], [3, 3, 4], [3, 3, 4], [3, 0, 4]]]]  # 4

  - [-1, 1, AA_SPDConv, [256]]  # 5-P4/16
  - [-1, 4, MultiBranchUIB, [256, 0.5, [[3, 5, 4], [3, 3, 4], [3, 3, 4], [3, 0, 4]]]]  # 6

  - [-1, 1, AA_SPDConv, [512]]  # 7-P5/32
  - [-1, 2, MultiBranchUIB, [512, 0.5, [[5, 5, 4], [3, 5, 4]]]]  # 8

# YOLOv8.0m head
head:
# 自顶向下路径
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 1, C2f, [256]]  # 11

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 1, C2f, [128]]  # 14 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]  # cat backbone P3
  - [-1, 2, C2f, [64]]  # 17 (P3/8-small)

  - [-1, 1, AA_SPDConv, [64]]
  - [[-1, 14], 1, Concat, [1]]  # cat head P4
  - [-1, 2, C2f, [128]]  # 20 (P4/16-medium)

  - [-1, 1, AA_SPDConv, [128]]
  - [[-1, 11], 1, Concat, [1]]  # cat head P4
  - [-1, 1, C2f, [256]]  # 23 (P4/16-medium)

  - [-1, 1, AA_SPDConv, [256]]
  - [[-1, 8], 1, Concat, [1]]  # cat head P5
  - [-1, 1, C2f, [512]]  # 26 (P5/32-large)

  - [[20, 23, 26], 1, Detect, [nc]]  # Detect(P3, P4, P5)